Documents/ДокументУТ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Document>
		<Properties>
			<Name>ДокументУТ</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.БонусыПоАктам</xr:Item>
				<xr:Item>AccumulationRegister.БюджетПоМесяцам</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидДокумента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДокументовУТ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>GUID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Договор</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Менеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Оплата</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Оплата</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Аванс</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсполнительДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КоммерческоеВознаграждение</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЗадачаПроекта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЗадачиПроектов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаВознаграждения</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаОбеспечено</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаПоСмете</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вручную</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/БонусыПоАктам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<AccumulationRegister>
		<Properties>
			<Name>БонусыПоАктам</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЗадачаПроекта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗадачиПроектов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Акт</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ДокументУТ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/БюджетПоМесяцам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<AccumulationRegister>
		<Properties>
			<Name>БюджетПоМесяцам</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>РКО</Name>
					<Comment>Факт облагается РКО</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Аналитика</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ЗадачаПроекта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗадачиПроектов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатьяСметы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиСметы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипСуммы</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипСуммыБюджета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Месяц</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/ТипСуммыБюджета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Enum>
		<Properties>
			<Name>ТипСуммыБюджета</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>План</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПервичныйДокумент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Факт</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/СметаЗадачиПроекта.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Document>
		<Properties>
			<Name>СметаЗадачиПроекта</Name>
			<BasedOn>
				<xr:Item>Catalog.ЗадачиПроектов</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.БюджетПоМесяцам</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЗадачаПроекта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗадачиПроектов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсполнительДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Конвертирована</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Группировка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Редактор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Документы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Документ</Name>
							<Type>
								<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВключитьВСмету</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Расчет</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КодСтатьи</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>5</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяСтатьи</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Статья</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиСметы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеПараметра</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>7</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИзмененоДокументом</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Итоговая</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ДокументУТ/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	// регистр БонусыПоАктам Приход
     Движения.БонусыПоАктам.Записывать = Истина;
	Для Каждого ТекСтрокаКоммерческоеВознаграждение Из КоммерческоеВознаграждение Цикл
		Движение = Движения.БонусыПоАктам.Добавить();
		Движение.ВидДвижения 	= ВидДвиженияНакопления.Приход;
		Движение.Период 		= Дата;
		Движение.Акт			= Ссылка;
		Движение.ЗадачаПроекта 	= ТекСтрокаКоммерческоеВознаграждение.ЗадачаПроекта;
		Движение.Сумма 			= ТекСтрокаКоммерческоеВознаграждение.СуммаВознаграждения;
	КонецЦикла;
	
	СписокЗадач = Новый СписокЗначений;
	СписокЗадач.ЗагрузитьЗначения(КоммерческоеВознаграждение.ВыгрузитьКолонку("ЗадачаПроекта"));
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СметаЗадачиПроекта.Ссылка,
	               |	СметаЗадачиПроекта.ЗадачаПроекта
	               |ИЗ
	               |	Документ.СметаЗадачиПроекта КАК СметаЗадачиПроекта
	               |ГДЕ
	               |	СметаЗадачиПроекта.ЗадачаПроекта В(&ЗадачаПроекта)";
	Запрос.УстановитьПараметр("ЗадачаПроекта",СписокЗадач);
	ТаблицаСмет = Запрос.Выполнить().Выгрузить();

	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	БюджетПоМесяцам.ЗадачаПроекта,
	               |	СУММА(БюджетПоМесяцам.Сумма) КАК Сумма,
	               |	БюджетПоМесяцам.СтатьяСметы
	               |ИЗ
	               |	РегистрНакопления.БюджетПоМесяцам КАК БюджетПоМесяцам
	               |ГДЕ
	               |	БюджетПоМесяцам.ТипСуммы = ЗНАЧЕНИЕ(Перечисление.ТипСуммыБюджета.Факт)
	               |	И (БюджетПоМесяцам.СтатьяСметы = ЗНАЧЕНИЕ(Справочник.СтатьиСметы.ДоходыВС)
	               |			ИЛИ БюджетПоМесяцам.СтатьяСметы = ЗНАЧЕНИЕ(Справочник.СтатьиСметы.ВознаграждениеКМ))
	               |	И БюджетПоМесяцам.ЗадачаПроекта В(&ЗадачаПроекта)
	               |	И БюджетПоМесяцам.Месяц = &Месяц
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	БюджетПоМесяцам.ЗадачаПроекта,
	               |	БюджетПоМесяцам.СтатьяСметы";
	Запрос.УстановитьПараметр("ЗадачаПроекта",СписокЗадач);
	Запрос.УстановитьПараметр("Месяц", НачалоМесяца(Дата));
	ФактическиеСуммы  = Запрос.Выполнить().выгрузить();
	
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	БюджетПоМесяцам.ЗадачаПроекта,
	               |	БюджетПоМесяцам.СтатьяСметы КАК СтатьяСметы,
	               |	СУММА(БюджетПоМесяцам.Сумма) КАК Сумма
	               |ИЗ
	               |	РегистрНакопления.БюджетПоМесяцам КАК БюджетПоМесяцам
	               |ГДЕ
	               |	БюджетПоМесяцам.Регистратор = &Регистратор
	               |	И БюджетПоМесяцам.ТипСуммы = ЗНАЧЕНИЕ(Перечисление.ТипСуммыБюджета.Факт)
	               |	И БюджетПоМесяцам.Месяц = &Месяц
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	БюджетПоМесяцам.ЗадачаПроекта,
	               |	БюджетПоМесяцам.СтатьяСметы";
	Запрос.УстановитьПараметр("Регистратор",Ссылка);
	Запрос.УстановитьПараметр("Месяц", НачалоМесяца(Дата));

	ЕстьПроводка = НЕ Запрос.Выполнить().Пустой();
	
	СуммыПоДанномуПлатежу = Запрос.Выполнить().Выгрузить();
	
	
	Движения.БюджетПоМесяцам.Записывать = Истина;
	
	
	
		
	Для Каждого ТекКоммерческоеВознаграждение Из КоммерческоеВознаграждение Цикл
		
		Сметы = ТаблицаСмет.НайтиСтроки(Новый Структура("ЗадачаПроекта",ТекКоммерческоеВознаграждение.ЗадачаПроекта));
		
		Если Сметы.Количество() > 0 Тогда
			СметаЗадачиПроекта = Сметы[0].Ссылка; 	
		Иначе
			Продолжить;
		КонецЕсли;
		
		СтрокаСметы = СметаЗадачиПроекта.Расчет.НайтиСтроки(Новый Структура("Статья",Справочники.СтатьиСметы.ВознагрПосредника));
		Если СтрокаСметы.Количество() > 0 Тогда
			Параметр = СтрокаСметы[0].ЗначениеПараметра/100;
			СуммаИзСметы =  СтрокаСметы[0].Сумма;
		Иначе	
			Продолжить;
		КонецЕсли;	
		
		СуммаВознагрПосредника = ОКР(ТекКоммерческоеВознаграждение.Сумма*Параметр,2);
		
		ЗаполнитьДвижениеПоМесяцам(ТекКоммерческоеВознаграждение, Движения, "ВознагрПосредника",СуммаВознагрПосредника);
		
		СтрокаСметы = СметаЗадачиПроекта.Расчет.НайтиСтроки(Новый Структура("Статья",Справочники.СтатьиСметы.РасходыВознПосредника));
		Если СтрокаСметы.Количество() > 0 Тогда
			Параметр = СтрокаСметы[0].ЗначениеПараметра/100;
			СуммаИзСметы =  СтрокаСметы[0].Сумма;
		Иначе	
			Продолжить;
		КонецЕсли;
		
		СуммаРасходыВознПосредника = ОКР(СуммаВознагрПосредника*Параметр,2);
		
		ЗаполнитьДвижениеПоМесяцам(ТекКоммерческоеВознаграждение, Движения, "РасходыВознПосредника",СуммаРасходыВознПосредника);
		
		СуммаДоходыВс =  ОКР(ТекКоммерческоеВознаграждение.Сумма - СуммаВознагрПосредника - СуммаРасходыВознПосредника,2); 
		
		ЗаполнитьДвижениеПоМесяцам(ТекКоммерческоеВознаграждение, Движения, "ДоходыВс",СуммаДоходыВс);
		
		// 4.
		// 2015 06 02 ФОТ по оплате
		//ЗаполнитьДвижениеПоМесяцам(ТекКоммерческоеВознаграждение, Движения, "ФОТ_ПП" );
		
		// 5. 
		// 2017 08 09 - оплата дает факт по статье 5.1 вознаграждение клиент менкеджера по проекту
		Если  ГодЗадачиПроекта( ТекКоммерческоеВознаграждение.ЗадачаПроекта ) >= 2017 Тогда
			СтрокаСметы = СметаЗадачиПроекта.Расчет.НайтиСтроки(Новый Структура("Статья",Справочники.СтатьиСметы.ДоходыВс));
			Если СтрокаСметы.Количество() > 0 Тогда
				Параметр = СтрокаСметы[0].ЗначениеПараметра/100;
				СуммаСметы = СтрокаСметы[0].Сумма;
			Иначе	
				Продолжить;
			КонецЕсли;                                                         
			
			СтрокаФакта = ФактическиеСуммы.НайтиСтроки(Новый Структура("ЗадачаПроекта,СтатьяСметы",ТекКоммерческоеВознаграждение.ЗадачаПроекта,Справочники.СтатьиСметы.ДоходыВс));
			Если СтрокаФакта.Количество() > 0 Тогда
				СуммаФакта1_1 = СтрокаФакта[0].Сумма;
			Иначе	
				СуммаФакта1_1 = 0;
			КонецЕсли;
			
			СтрокаФакта = ФактическиеСуммы.НайтиСтроки(Новый Структура("ЗадачаПроекта,СтатьяСметы",ТекКоммерческоеВознаграждение.ЗадачаПроекта,Справочники.СтатьиСметы.ВознаграждениеКМ));
			Если СтрокаФакта.Количество() > 0 Тогда
				СуммаФакта5_1 = СтрокаФакта[0].Сумма;
			Иначе	
				СуммаФакта5_1 = 0;
			КонецЕсли;

			
			Если ЕстьПроводка Тогда
				ДоляОбеспечения = СуммаФакта1_1/СуммаСметы;
			Иначе
				ДоляОбеспечения = СуммаФакта1_1 + ТекКоммерческоеВознаграждение.Сумма/СуммаСметы;
			КонецЕсли;	
			
			СтрокаСметы = СметаЗадачиПроекта.Расчет.НайтиСтроки(Новый Структура("Статья",Справочники.СтатьиСметы.ВознаграждениеКМ));
			Если СтрокаСметы.Количество() > 0 Тогда
				Параметр = СтрокаСметы[0].ЗначениеПараметра/100;
				СуммаСметы = СтрокаСметы[0].Сумма;
			Иначе	
				Продолжить;
			КонецЕсли;    
			
			База = ДоляОбеспечения * СуммаСметы;
			
			Если ЕстьПроводка Тогда 
					
				Начисление = База - СуммаФакта5_1 - ТекКоммерческоеВознаграждение.Сумма; 
			Иначе
				Начисление = База - СуммаФакта5_1;
			КонецЕсли;
			
			Если начисление > 0 тогда
				
				ЗаполнитьДвижениеПоМесяцам(ТекКоммерческоеВознаграждение, Движения, "ВознаграждениеКМ",Начисление);
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	
КонецПроцедуры

Процедура ЗаполнитьДвижениеПоМесяцам(Стр, Движения, ИмяСтатьи,Сумма)
	
	// 2017 08 09 
	
	
	
	//Сумма = Стр.Сумма; // Стр[ИмяСтатьи];
	СтатьяСметы = Справочники.СтатьиСметы[ИмяСтатьи];
	
			
	
	Если Сумма = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Движение = Движения.БюджетПоМесяцам.Добавить();
	
	Движение.Период 		= Дата;
	Движение.ЗадачаПроекта 	= Стр.ЗадачаПроекта;
	Движение.СтатьяСметы 	= СтатьяСметы;
	// 08,04,20013
	Движение.ТипСуммы 		= Перечисления.ТипСуммыБюджета.Факт;  // факт
	Движение.Месяц 			= НачалоМесяца(Дата);
	// 2016 02 15 
	Движение.РКО			= Истина;
	//
	
	
	Движение.Сумма       = Сумма;	

	
КонецПроцедуры
